Let's learn more about pandas! Let's load the appropriate library
# Initialize

In [1]:
import pandas as pd
import numpy as np

<font color='red'>To-do:</font> Load nfl_football_profiles.json to pandas df named nfl

In [2]:
nfl = pd.read_json("nfl_football_profiles.json")

Lets clean up the data:
Let's remove all the commas in the current_salary column in a new column called salary

In [3]:
nfl['salary'] = nfl['current_salary'].str.replace(',', '')

Let's clean this up further by converting the data type to a float

In [4]:
nfl['salary'] = nfl['salary'].astype(float)

In [5]:
nfl['salary'].head(10)

0          NaN
1          NaN
2    1075000.0
3          NaN
4          NaN
5          NaN
6    1762000.0
7          NaN
8          NaN
9          NaN
Name: salary, dtype: float64

<font color='red'>To-do:</font> Remove all NaN values in salary from the nfl df into a new df called nfl_salary_cleaned

In [7]:
nfl_salary_cleaned = nfl.dropna(how="any", subset=["salary"])

# Dummy variables and discretizing salaries

<font color='red'>To-do:</font> Using the same NFL dataset, lets discretize the salaries. Let's create bins by splitting salaries into five equally sized groups (hint: use pd.Series.quantiles and np.linspace)

In [8]:
bins = nfl["salary"].quantile(np.linspace(0,1,6))
bins

0.0       38294.0
0.2      465000.0
0.4      615000.0
0.6      800000.0
0.8     1797000.0
1.0    23943600.0
Name: salary, dtype: float64

Using these bins that we set, we can set labels to them and have them categorized by that bin by using pd.cut()

In [9]:
pd.cut(nfl_salary_cleaned['salary'],bins,labels=['d0','d2','d4','d6','d8'])[0:10]

2      d6
6      d6
13     d4
37     d8
53     d8
57     d6
90     d2
106    d8
113    d0
114    d8
Name: salary, dtype: category
Categories (5, object): ['d0' < 'd2' < 'd4' < 'd6' < 'd8']

Similarly, we can create dummy variables to categorize our labels and bins into an organized dataframe by using pd.get_dummies(). It will display whether a player fits into our labels based on their salary bin range.

In [10]:
dummy_variable = pd.get_dummies(pd.cut(nfl_salary_cleaned['salary'],bins,labels=['d0','d2','d4','d6','d8']))

In [11]:
dummy_variable.head()

    d0  d2  d4  d6  d8
2    0   0   0   1   0
6    0   0   0   1   0
13   0   0   1   0   0
37   0   0   0   0   1
53   0   0   0   0   1

# Joining and Merging Datasets

Let's create some simple dataframes

In [12]:
drinks1 = pd.DataFrame({'Drinks': ['Coca-Cola', 'Sprite', 'Fanta', 'Root-Beer', 'Dr. Pepper'],
                   'Prices': [0.99, 1.49, 1.99, 2.49, 5],
                   'id': ['D01', 'D02', 'D03', 'D04', 'D05']})

In [13]:
drinks1.head()

       Drinks  Prices   id
0   Coca-Cola    0.99  D01
1      Sprite    1.49  D02
2       Fanta    1.99  D03
3   Root-Beer    2.49  D04
4  Dr. Pepper    5.00  D05

In [14]:
drinks2 = pd.DataFrame({'Drinks': ['Squirt', 'Ginger-Ale', 'Cream-Soda', 'Pepsi'],
                   'Prices': [0.49, 0.99, 1.99, 1.49],
                   'id': ['D06', 'D07', 'D08', 'D09']})

In [15]:
drinks2.head()

       Drinks  Prices   id
0      Squirt    0.49  D06
1  Ginger-Ale    0.99  D07
2  Cream-Soda    1.99  D08
3       Pepsi    1.49  D09

<font color='red'>To-do:</font> Concatenate drinks1 and drinks2 on rows, but ignore indexes. Show all 9 rows on the df

In [16]:
df = pd.concat([drinks1, drinks2], ignore_index=True)
df

       Drinks  Prices   id
0   Coca-Cola    0.99  D01
1      Sprite    1.49  D02
2       Fanta    1.99  D03
3   Root-Beer    2.49  D04
4  Dr. Pepper    5.00  D05
5      Squirt    0.49  D06
6  Ginger-Ale    0.99  D07
7  Cream-Soda    1.99  D08
8       Pepsi    1.49  D09

Now let's practice joining tables. Load in title.ratings.tsv and title.basics.tsv. <font color='red'>These files are included in the zipped file you downloaded with your lab instructions. </font>

In [17]:
ratings = pd.read_csv('title.ratings.tsv', sep='\t')

In [18]:
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.6      1646
1  tt0000002            6.1       198
2  tt0000003            6.5      1345
3  tt0000004            6.2       120
4  tt0000005            6.1      2131

In [19]:
titles = pd.read_csv('title.basics.tsv', sep='\t')

C:\Users\PANDA\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3165: DtypeWarning: Columns (5) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [20]:
titles.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

Notice that on titles and ratings, tconst is the same. We can therefore join these two dataframe using that column as index.

<font color='red'>To-do:</font> Merge ratings and titles in a dataframe called imdb_info on tconst. In a markdown cell, explain what kind of join this is and why you chose to use it.

In [21]:
imdb_info = pd.merge(titles, ratings, how="inner", on="tconst")
imdb_info

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,averageRating,numVotes
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short",5.6,1646
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short",6.1,198
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance",6.5,1345
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short",6.2,120
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short",6.1,2131
...,...,...,...,...,...,...,...,...,...,...,...
1071724,tt9916580,tvEpisode,Horrid Henry Horrid Boy?,Horrid Henry Horrid Boy?,0,2012,\N,10,"Animation,Comedy,Family",7.2,5
1071725,tt9916690,tvEpisode,Horrid Henry Delivers the Milk,Horrid Henry Delivers the Milk,0,2012,\N,\N,"Animation,Comedy,Family",6.6,5
1071726,tt9916720,short,The Nun 2,The Nun 2,0,2019,\N,10,"Comedy,Horror,Mystery",5.8,60
1071727,tt9916766,tvEpisode,Episode #10.15,Episode #10.15,0,2019,\N,43,"Family,Reality-TV",6.9,14
1071728,tt9916778,tvEpisode,Escape,Escape,0,2019,\N,\N,Drama,7.3,24

I use inner join because I think title and rating are both necessary for movie analysis

<font color='red'>To-do:</font> In a markdown cell, explain the difference between an inner join, outer join, right join, and left join.

- left join
For each row in the left table, we find one row in the right table who has a matched key. If the right table doesn't contain such one, the left row will has NaN in the corresponding fields.
In this case, the length of joined table is equals to the length of left table.
- right join
For each row in the right table, we find one row in the left table who has a matched key. If the left table doesn't contain such one, the right row will has NaN in the corresponding fields.
In this case, the length of joined table is equals to the length of right table.
- inner join
For each row in the left table, we find one row in the right table who has a matched key. If the right table doesn't contain such one, the left row will also be discarded.
In this case, the length of joined table is equals to the rows with keys matched in another table.
- outer join
Based on inner joined dataframe, if a row in left or right table is not matched, it will be appended to the dataframe with missing fields filled with NaN instead of being discarded

<font color='red'>To-do:</font> What is the difference between pd.concat and pd.merge?

- pd.concat
pd.concat just connects one dataframe onto another.
If we concat along column, we don't need to choose the key.
If we concat along rows, the index will be used as the key.
- pd.merge
pd.merge connects two dataframes based on specific field shared by both dataframes. The rule for connecting can be chosen as inner, outer, left or right, and they will choose specific rows from the dataframes.

# Exploding, manipulation and grouping practice, YAY!

Let's look at the genres in our imdb_info df. Use explode function to create a row per genre, title pair. (Similar to Q14 in HW1). There also appears to be '\N' tacked onto each of the cells. Let's also get rid of that.

In [22]:
imdb_info.genres = imdb_info.genres.str.extract(r'([a-zA-Z,]*)')
imdb_info.loc[:,"genre_list"] = imdb_info.apply(lambda x: str(x["genres"]).split(","),axis=1)
df_genre = imdb_info.explode("genre_list")
df_genre.rename(columns={'genre_list':'genre'}, inplace=True)

In [23]:
imdb_info.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,averageRating,numVotes,genre_list
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short",5.6,1646,"[Documentary, Short]"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short",6.1,198,"[Animation, Short]"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance",6.5,1345,"[Animation, Comedy, Romance]"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short",6.2,120,"[Animation, Short]"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short",6.1,2131,"[Comedy, Short]"

Looking at runtimeMinutes, we see that its type is object.

In [24]:
df_genre['runtimeMinutes'].head()

0    1
0    1
1    5
1    5
2    4
Name: runtimeMinutes, dtype: object

We want to fix the data up a bit more. There appears to be '\\N' tacked onto the end of runtimeMinutes. Let's just grab the number in each of the cells by using some regex

<font color='red'>To-do:</font> Extract the numeric values from the runtimeMinutes column. (HINT: use .str.extract())

In [25]:
df_genre["runtimeMinutes"] = df_genre["runtimeMinutes"].str.extract("\D*(\\d+)\D*")

<font color='red'>To-do:</font> Change the object dtype of runtimeMinutes to float.

In [26]:
df_genre["runtimeMinutes"] = df_genre["runtimeMinutes"].astype(float)

Let's practice using some groupby on the dataset. Let's look at the df by grouping by the average rating

In [27]:
df_genre.groupby('averageRating').sum()

               isAdult  runtimeMinutes  numVotes
averageRating
1.0                  4         26444.0    208524
1.1                  9         11054.0     34632
1.2                  9         14083.0     37745
1.3                  9         15836.0    133439
1.4                  3         17615.0    250526
...                ...             ...       ...
9.6                 44         82023.0   2590258
9.7                 17         43255.0   2603109
9.8                 35         40721.0   1293387
9.9                 11         14948.0   2526855
10.0                40         21242.0    403865

[91 rows x 3 columns]

<font color='red'>To-do:</font> Find the average number of votes for averageRating for each genre. Find the first quartile.

In [27]:
df_clean_genre = df_genre.copy()
df_clean_genre["genres"] = df_genre["genres"].str.split(",")
df_clean_genre = df_clean_genre.explode(column="genres", ignore_index=True)
df_clean_genre.groupby("genres")["averageRating"].quantile(0.25)

genres
               5.5
Action         6.3
Adult          5.4
Adventure      6.4
Animation      6.4
Biography      6.6
Comedy         6.2
Crime          6.5
Documentary    6.6
Drama          6.3
Family         6.4
Fantasy        6.4
Film           6.2
Game           6.3
History        6.7
Horror         5.1
Music          6.2
Musical        5.7
Mystery        6.6
News           6.0
Reality        6.1
Romance        6.0
Sci            6.1
Short          6.0
Sport          6.2
Talk           6.0
Thriller       5.4
War            6.3
Western        6.2
Name: averageRating, dtype: float64

<font color='red'>To-do:</font> What is the total number of votes for each genre, for each start year? (hint - use groupby)

In [28]:
df_clean_genre.groupby(["genres", "startYear"])["numVotes"].count()

genres   startYear
         1905           1
         1909           3
         1910          10
         1911           8
         1912           6
                     ...
Western  2016         258
         2017         298
         2018         220
         2019         164
         2020          66
Name: numVotes, Length: 4902, dtype: int64

# Analysis on Child Opportunity Index

Now let's analyse the child opportunity dataset from the lecture with the tools we've learnt today. But, first let's load the Child Opportunity Index json file from the lecture. Column descriptions can be found at this [link](https://data.diversitydatakids.org/dataset/coi20-child-opportunity-index-2-0-database/resource/f16fff12-b1e5-4f60-85d3-3a0ededa30a0)

In [28]:
opportunity = pd.read_json('raw.json')

<font color='red'>To-do:</font>  Create a dataframe that shows the min, average and maximum median household income in census tracts that belong to a top 100 metropolitan area and those that don't (hint: use groupby and apply to do this)

In [30]:
df_se_mhe = pd.DataFrame({"min": opportunity.groupby("in100")["SE_MHE"].min(), \
    "max": opportunity.groupby("in100")["SE_MHE"].max(), \
    "average": opportunity.groupby("in100")["SE_MHE"].mean()})

<font color='red'>To-do:</font> Create a a new column in the dataframe by bucketing the median household income into 4 equal sized in terms of number of rows groups (hint use pd.Series.quantile function) "low_mhe","low-medium_mhe", "high-medium_mhe", and "high_mhe".

In [39]:
bins = opportunity["SE_MHE"].quantile(np.linspace(0, 1, 5))
opportunity["SE_MHE_BUCKET"] = pd.cut(opportunity["SE_MHE"], bins, labels=["low_mhe","low-medium_mhe", "high-medium_mhe", "high_mhe"])
opportunity["SE_MHE_BUCKET"]

0         high-medium_mhe
1         high-medium_mhe
2          low-medium_mhe
3          low-medium_mhe
4          low-medium_mhe
               ...
146107     low-medium_mhe
146108    high-medium_mhe
146109    high-medium_mhe
146110     low-medium_mhe
146111     low-medium_mhe
Name: SE_MHE_BUCKET, Length: 146112, dtype: category
Categories (4, object): ['low_mhe' < 'low-medium_mhe' < 'high-medium_mhe' < 'high_mhe']

<font color='red'>To-do:</font> Now create a table such that the index corresponds to whether a census tract belongs to top 100 metropolitan area, the columns correspond to the median household income bucket and the values correspond to average third-grade math proficiency. As a challenge, consider what you may be able say about (i) the relationship between household income and math proficiency of children as a whole and (ii) how this relationship differs between big cities and elsewehere?

In [32]:
df = pd.DataFrame(opportunity.groupby(["in100", "SE_MHE_BUCKET"])["ED_MATH"].mean()).reset_index()
df.pivot(index="in100", columns="SE_MHE_BUCKET", values="ED_MATH")

SE_MHE_BUCKET     low_mhe  low-medium_mhe  high-medium_mhe    high_mhe
in100
0.0            205.024781      220.900619       229.021845  242.240327
1.0            177.554489      205.821513       224.600362  257.436952